
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НаименованиеТовара = Ждать ВвестиСтрокуАсинх("", "Введите наименование товара");
	
	Если ПроверитьСуществованиеТовара(НаименованиеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден.", НаименованиеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден.", НаименованиеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
КонецПроцедуры

Функция ПроверитьСуществованиеТовара(НаименованиеТовара)
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Товар");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Товар = "Гитара";
	СтрокаТовара.Цена = "100";
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Товар = "Микрофон";
	СтрокаТовара.Цена = "50";
	
	ТоварСуществует = Справочники.Товары.НайтиТоварПоНаименованию(НаименованиеТовара);
	Возврат ТоварСуществует;
КонецФункции