
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НаименованиеТовара = Ждать ВвестиСтрокуАсинх("", "Введите наименование товара");
	
	Если ПроверитьСуществованиеТовара(НаименованиеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден.", НаименованиеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден.", НаименованиеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
КонецПроцедуры

Функция ПроверитьСуществованиеТовара(НаименованиеТовара)
	ТоварСуществует = Справочники.Товары.НайтиТоварПоНаименованию(НаименованиеТовара);
	Возврат ТоварСуществует;
КонецФункции